Autodesk.Revit.DB.FamilyParameter.UserModifiable
Indicates whether the interactive user can modify the value of this parameter.
Since:  2015
Remarks:
Note that for shared parameters IsReadOnly can return false for shared parameters whose UserModifiable property is
also false, because the value of those parameters can be modified by the API. If a parameter is governed by a formula,
IsReadOnly would return true, even if the flag for UserModifiable was set to true when the shared parameter was created.

Autodesk.Revit.DB.FamilyParameter.IsReadOnly
Identifies if the object is read-only or modifiable.
If true, the object may not be modified.  If false, the object's contents may be modified.

Autodesk.Revit.DB.FamilyParameter.IsShared
Identifies if the parameter is a shared parameter.
Since: 2014

Autodesk.Revit.DB.FamilyParameter.GUID
The globally unique identifier
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the parameter is not a shared parameter.
Since: 2012

Autodesk.Revit.DB.FamilyParameter.Id
The id of the family parameter.
Since: 2011

Autodesk.Revit.DB.FamilyParameter.AssociatedParameters
The parameters from elements in the family which are associated to this parameter.

Autodesk.Revit.DB.FamilyParameter.DisplayUnitType
The display unit type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this parameter is not of value type.

Autodesk.Revit.DB.FamilyParameter.Formula
The formula.
Remarks: Returns null if there is no formula governing this parameter.

Autodesk.Revit.DB.FamilyParameter.CanAssignFormula
Indicates if this parameter can be assigned a formula.

Autodesk.Revit.DB.FamilyParameter.IsDeterminedByFormula
Indicates if the parameter is determined by formula.
Remarks: The parameter is read only if it is determined by formula.

Autodesk.Revit.DB.FamilyParameter.IsReporting
Indicates if the parameter is a reporting parameter.
Remarks: If true, the parameter is a reporting parameter associated to a dimension value,
and cannot be modified. If false, the parameter is a driving parameter and if associated
to a dimension, can modify the dimension it labels.
Since: 2011

Autodesk.Revit.DB.FamilyParameter.IsInstance
Indicates if the parameter is instance or type.

Autodesk.Revit.DB.FamilyParameter.StorageType
The storage type describes the type that is used internally within the parameter to store its value.
Remarks: The property will return one of the following possibilities: String, Integer, Double
or ElementId. Based on the value of this property the correct access and set methods should be used
to retrieve and set the parameter's data value.

Autodesk.Revit.DB.FamilyParameter.Definition
The definition.

Autodesk.Revit.DB.FamilyParameter
The family parameter object.